In [2]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
%sql sqlite:///Chinook_Sqlite.sqlite

In [4]:
%%sql
SELECT * FROM Album LIMIT 10;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3),
 (6, 'Jagged Little Pill', 4),
 (7, 'Facelift', 5),
 (8, 'Warner 25 Anos', 6),
 (9, 'Plays Metallica By Four Cellos', 7),
 (10, 'Audioslave', 8)]

In [5]:
%%sql
SELECT TrackID,Name,AlbumID
FROM Track LIMIT 10

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 'For Those About To Rock (We Salute You)', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Fast As a Shark', 3),
 (4, 'Restless and Wild', 3),
 (5, 'Princess of the Dawn', 3),
 (6, 'Put The Finger On You', 1),
 (7, "Let's Get It Up", 1),
 (8, 'Inject The Venom', 1),
 (9, 'Snowballed', 1),
 (10, 'Evil Walks', 1)]

In [6]:
%%sql
SELECT album.Title as album_title,
track.name as track_name 
FROM Track track
JOIN Album album ON track.AlbumId = album.AlbumId
LIMIT 10;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[('For Those About To Rock We Salute You', 'For Those About To Rock (We Salute You)'),
 ('Balls to the Wall', 'Balls to the Wall'),
 ('Restless and Wild', 'Fast As a Shark'),
 ('Restless and Wild', 'Restless and Wild'),
 ('Restless and Wild', 'Princess of the Dawn'),
 ('For Those About To Rock We Salute You', 'Put The Finger On You'),
 ('For Those About To Rock We Salute You', "Let's Get It Up"),
 ('For Those About To Rock We Salute You', 'Inject The Venom'),
 ('For Those About To Rock We Salute You', 'Snowballed'),
 ('For Those About To Rock We Salute You', 'Evil Walks')]

In [7]:
%%sql
SELECT * FROM Artist LIMIT 10;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 'AC/DC'),
 (2, 'Accept'),
 (3, 'Aerosmith'),
 (4, 'Alanis Morissette'),
 (5, 'Alice In Chains'),
 (6, 'Antônio Carlos Jobim'),
 (7, 'Apocalyptica'),
 (8, 'Audioslave'),
 (9, 'BackBeat'),
 (10, 'Billy Cobham')]

In [8]:
%%sql
Select *
From Invoice LIMIT 10;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86),
 (6, 37, '2009-01-19 00:00:00', 'Berger Straße 10', 'Frankfurt', None, 'Germany', '60316', 0.99),
 (7, 38, '2009-02-01 00:00:00', 'Barbarossastraße 19', 'Berlin', None, 'Germany', '10779', 1.98),
 (8, 40, '2009-02-01 00:00:00', '8, Rue Hanovre', 'Paris', None, 'France', '75002', 1.98),
 (9, 42, '2009-02-02 00:00:00', '9, Place Louis Barthou', 'Bordeaux', None, 'France', '33000', 3.96),
 (10, 46, '2009-02-03 00:00:00', '3 Chatham Street', 'Dublin', 'Dublin', 'Ireland', None, 5.94)]

In [9]:
%%sql
Select Playlistid,
Name
From Playlist LIMIT 10;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 'Music'),
 (2, 'Movies'),
 (3, 'TV Shows'),
 (4, 'Audiobooks'),
 (5, '90’s Music'),
 (6, 'Audiobooks'),
 (7, 'Movies'),
 (8, 'Music'),
 (9, 'Music Videos'),
 (10, 'TV Shows')]

In [10]:
%%sql
Select CustomerId,
InvoiceDate, 
BillingCity 
From Invoice LIMIT 10;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(2, '2009-01-01 00:00:00', 'Stuttgart'),
 (4, '2009-01-02 00:00:00', 'Oslo'),
 (8, '2009-01-03 00:00:00', 'Brussels'),
 (14, '2009-01-06 00:00:00', 'Edmonton'),
 (23, '2009-01-11 00:00:00', 'Boston'),
 (37, '2009-01-19 00:00:00', 'Frankfurt'),
 (38, '2009-02-01 00:00:00', 'Berlin'),
 (40, '2009-02-01 00:00:00', 'Paris'),
 (42, '2009-02-02 00:00:00', 'Bordeaux'),
 (46, '2009-02-03 00:00:00', 'Dublin')]

In [11]:
%%sql
Select TrackId, 
GenreId, 
Composer, 
UnitPrice 
From Track LIMIT 10

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 0.99),
 (2, 1, None, 0.99),
 (3, 1, 'F. Baltes, S. Kaufman, U. Dirkscneider & W. Hoffman', 0.99),
 (4, 1, 'F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. Dirkscneider & W. Hoffman', 0.99),
 (5, 1, 'Deaffy & R.A. Smith-Diesel', 0.99),
 (6, 1, 'Angus Young, Malcolm Young, Brian Johnson', 0.99),
 (7, 1, 'Angus Young, Malcolm Young, Brian Johnson', 0.99),
 (8, 1, 'Angus Young, Malcolm Young, Brian Johnson', 0.99),
 (9, 1, 'Angus Young, Malcolm Young, Brian Johnson', 0.99),
 (10, 1, 'Angus Young, Malcolm Young, Brian Johnson', 0.99)]

In [12]:
%%sql
Select DISTINCT PlaylistId 
From PlaylistTrack

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1,),
 (3,),
 (5,),
 (8,),
 (9,),
 (10,),
 (11,),
 (12,),
 (13,),
 (14,),
 (15,),
 (16,),
 (17,),
 (18,)]

In [13]:
%%sql
Select PlaylistId,TrackId 
From PlaylistTrack LIMIT 10;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 3402),
 (1, 3389),
 (1, 3390),
 (1, 3391),
 (1, 3392),
 (1, 3393),
 (1, 3394),
 (1, 3395),
 (1, 3396),
 (1, 3397)]

In [14]:
%%sql
Select *
From MediaType
Limit 50;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 'MPEG audio file'),
 (2, 'Protected AAC audio file'),
 (3, 'Protected MPEG-4 video file'),
 (4, 'Purchased AAC audio file'),
 (5, 'AAC audio file')]

In [15]:
%%sql
Select PlaylistId 
From PlaylistTrack
WHERE PlaylistId>2 LIMIT 10;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(3,), (3,), (3,), (3,), (3,), (3,), (3,), (3,), (3,), (3,)]

In [16]:
%%sql
Select DISTINCT PlaylistId 
From PlaylistTrack
WHERE PlaylistId<>2 LIMIT 10;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1,), (3,), (5,), (8,), (9,), (10,), (11,), (12,), (13,), (14,)]

In [17]:
%%sql
Select COUNT(PlaylistId) 
From PlaylistTrack
WHERE PlaylistId;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(8715,)]

In [18]:
%%sql
Select DISTINCT PlaylistId 
From PlaylistTrack
WHERE PlaylistId
BETWEEN 0 AND 4;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1,), (3,)]

In [19]:
%%sql
SELECT * FROM Album WHERE Title IS NULL;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[]

In [20]:
%%sql
SELECT * FROM Album LIMIT 10;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3),
 (6, 'Jagged Little Pill', 4),
 (7, 'Facelift', 5),
 (8, 'Warner 25 Anos', 6),
 (9, 'Plays Metallica By Four Cellos', 7),
 (10, 'Audioslave', 8)]

In [21]:
%%sql
SELECT * FROM ALbum WHERE ArtistId IN (1,2,3)

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 'For Those About To Rock We Salute You', 1),
 (4, 'Let There Be Rock', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (5, 'Big Ones', 3)]

In [22]:
%%sql
SELECT * FROM ALbum WHERE ArtistId==1;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 'For Those About To Rock We Salute You', 1), (4, 'Let There Be Rock', 1)]

In [23]:
%%sql
SELECT * FROM ALbum WHERE AlbumId IN (1,4)

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 'For Those About To Rock We Salute You', 1), (4, 'Let There Be Rock', 1)]

In [24]:
%%sql
SELECT * FROM ALbum WHERE AlbumId = 1 OR AlbumId = 4;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 'For Those About To Rock We Salute You', 1), (4, 'Let There Be Rock', 1)]

In [25]:
%%sql
SELECT * FROM Album WHERE(ArtistId=2 OR ArtistId=8) AND AlbumId>2 LIMIT 50;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(3, 'Restless and Wild', 2),
 (10, 'Audioslave', 8),
 (11, 'Out Of Exile', 8),
 (271, 'Revelations', 8)]

In [26]:
%%sql
SELECT * FROM Album WHERE(ArtistId=2 OR ArtistId=8) AND AlbumId<>10 LIMIT 50;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (11, 'Out Of Exile', 8),
 (271, 'Revelations', 8)]

In [27]:
%%sql
SELECT * FROM Album WHERE Title LIKE '%Wall%';

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(2, 'Balls to the Wall', 2)]

In [28]:
%%sql
SELECT * FROM Album WHERE Title LIKE 'Bal%';

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(2, 'Balls to the Wall', 2)]

In [29]:
%%sql
SELECT * FROM Album WHERE Title LIKE '%Wall';

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(2, 'Balls to the Wall', 2)]

Statement with wildcards will take longer to run if used at the end of the search patterns.Thats why placement of wildcards is important

In [30]:
%%sql
SELECT * FROM Album ORDER BY AlbumId DESC LIMIT 10 ;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(347, 'Koyaanisqatsi (Soundtrack from the Motion Picture)', 275),
 (346, 'Mozart: Chamber Music', 274),
 (345, "Monteverdi: L'Orfeo", 273),
 (344, "Schubert: The Late String Quartets & String Quintet (3 CD's)", 272),
 (343, 'Respighi:Pines of Rome', 226),
 (342, 'Locatelli: Concertos for Violin, Strings and Continuo, Vol. 3', 271),
 (341, 'Great Recordings of the Century - Shubert: Schwanengesang, 4 Lieder', 270),
 (340, "Liszt - 12 Études D'Execution Transcendante", 269),
 (339, "Great Recordings of the Century: Paganini's 24 Caprices", 268),
 (338, 'Nielsen: The Six Symphonies', 267)]

In [31]:
%%sql
SELECT * FROM Album ORDER BY AlbumId ASC LIMIT 10 ;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3),
 (6, 'Jagged Little Pill', 4),
 (7, 'Facelift', 5),
 (8, 'Warner 25 Anos', 6),
 (9, 'Plays Metallica By Four Cellos', 7),
 (10, 'Audioslave', 8)]

In [32]:
%%sql
.tables

 * sqlite:///Chinook_Sqlite.sqlite
(sqlite3.OperationalError) near ".": syntax error
[SQL: .tables]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

AGGRAGATE FUNCTION
    * AVG() ,
    *COUNT() ,
    *MIN() ,
    *MAX() ,
    *SUM() ,

In [33]:
%%sql
SELECT * FROM InvoiceLine ORDER BY InvoiceLineId DESC LIMIT 50 ;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(2240, 412, 3177, 1.99, 1),
 (2239, 411, 3163, 0.99, 1),
 (2238, 411, 3154, 0.99, 1),
 (2237, 411, 3145, 0.99, 1),
 (2236, 411, 3136, 0.99, 1),
 (2235, 411, 3127, 0.99, 1),
 (2234, 411, 3118, 0.99, 1),
 (2233, 411, 3109, 0.99, 1),
 (2232, 411, 3100, 0.99, 1),
 (2231, 411, 3091, 0.99, 1),
 (2230, 411, 3082, 0.99, 1),
 (2229, 411, 3073, 0.99, 1),
 (2228, 411, 3064, 0.99, 1),
 (2227, 411, 3055, 0.99, 1),
 (2226, 411, 3046, 0.99, 1),
 (2225, 410, 3037, 0.99, 1),
 (2224, 410, 3031, 0.99, 1),
 (2223, 410, 3025, 0.99, 1),
 (2222, 410, 3019, 0.99, 1),
 (2221, 410, 3013, 0.99, 1),
 (2220, 410, 3007, 0.99, 1),
 (2219, 410, 3001, 0.99, 1),
 (2218, 410, 2995, 0.99, 1),
 (2217, 410, 2989, 0.99, 1),
 (2216, 409, 2983, 0.99, 1),
 (2215, 409, 2979, 0.99, 1),
 (2214, 409, 2975, 0.99, 1),
 (2213, 409, 2971, 0.99, 1),
 (2212, 409, 2967, 0.99, 1),
 (2211, 409, 2963, 0.99, 1),
 (2210, 408, 2959, 0.99, 1),
 (2209, 408, 2957, 0.99, 1),
 (2208, 408, 2955, 0.99, 1),
 (2207, 408, 2953, 0.99, 1),
 (2206, 407, 2951, 0.99, 1),
 (2205, 407, 2949, 0.99, 1),
 (2204, 406, 2947, 0.99, 1),
 (2203, 406, 2946, 0.99, 1),
 (2202, 405, 2945, 0.99, 1),
 (2201, 404, 2931, 0.99, 1),
 (2200, 404, 2922, 1.99, 1),
 (2199, 404, 2913, 1.99, 1),
 (2198, 404, 2904, 1.99, 1),
 (2197, 404, 2895, 1.99, 1),
 (2196, 404, 2886, 1.99, 1),
 (2195, 404, 2877, 1.99, 1),
 (2194, 404, 2868, 1.99, 1),
 (2193, 404, 2859, 1.99, 1),
 (2192, 404, 2850, 1.99, 1),
 (2191, 404, 2841, 1.99, 1)]

In [34]:
%%sql
SELECT InvoiceLineId,InvoiceId,TrackId,UnitPrice,Quantity,round((UnitPrice*Quantity)*1.5,2) AS TOTAL_COST_WITH_VAT FROM InvoiceLine ORDER BY InvoiceLineId DESC LIMIT 10 ;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(2240, 412, 3177, 1.99, 1, 2.99),
 (2239, 411, 3163, 0.99, 1, 1.49),
 (2238, 411, 3154, 0.99, 1, 1.49),
 (2237, 411, 3145, 0.99, 1, 1.49),
 (2236, 411, 3136, 0.99, 1, 1.49),
 (2235, 411, 3127, 0.99, 1, 1.49),
 (2234, 411, 3118, 0.99, 1, 1.49),
 (2233, 411, 3109, 0.99, 1, 1.49),
 (2232, 411, 3100, 0.99, 1, 1.49),
 (2231, 411, 3091, 0.99, 1, 1.49)]

In [35]:
%%sql
SELECT AVG(round((UnitPrice*Quantity)*1.5,2)) AS AVG_COST_WITH_VAT FROM InvoiceLine ;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1.5643303571427714,)]

In [36]:
%%sql
SELECT AVG(UnitPrice) AS Average_unit_price FROM InvoiceLine ;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1.0395535714285522,)]

In [37]:
%%sql
SELECT COUNT(*) AS TOTAL_ROW FROM ALbum

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(347,)]

In [38]:
%%sql
SELECT COUNT(*) AS TOTAL_CUSTOMER FROM Customer;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(59,)]

In [39]:
%%sql
SELECT MIN(UnitPrice) AS minimum_unit_price FROM InvoiceLine ;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(0.99,)]

In [40]:
%%sql
SELECT MAX(UnitPrice) AS maximum_unit_price FROM InvoiceLine ;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1.99,)]

In [41]:
%%sql
SELECT SUM(UnitPrice) AS total_99_unit_price FROM InvoiceLine WHERE UnitPrice=0.99 ;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(2107.710000000004,)]

In [42]:
%%sql
SELECT SUM(UnitPrice) AS total_1_99_unit_price FROM InvoiceLine WHERE UnitPrice=1.99 ;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(220.89000000000027,)]

In [43]:
%%sql
SELECT COUNT(UnitPrice) AS total_99_unit_price FROM InvoiceLine WHERE UnitPrice=0.99 ;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(2129,)]

In [44]:
%%sql
SELECT COUNT(UnitPrice) AS total_99_unit_price FROM InvoiceLine WHERE UnitPrice=1.99 ;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(111,)]

CAN NOT USE DISTINCT() on COUNT(*)

In [45]:
%%sql
SELECT COUNT(*) AS total_customer_listed FROM Invoice ;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(412,)]

In [46]:
%%sql
SELECT * FROM Invoice LIMIT 10;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86),
 (6, 37, '2009-01-19 00:00:00', 'Berger Straße 10', 'Frankfurt', None, 'Germany', '60316', 0.99),
 (7, 38, '2009-02-01 00:00:00', 'Barbarossastraße 19', 'Berlin', None, 'Germany', '10779', 1.98),
 (8, 40, '2009-02-01 00:00:00', '8, Rue Hanovre', 'Paris', None, 'France', '75002', 1.98),
 (9, 42, '2009-02-02 00:00:00', '9, Place Louis Barthou', 'Bordeaux', None, 'France', '33000', 3.96),
 (10, 46, '2009-02-03 00:00:00', '3 Chatham Street', 'Dublin', 'Dublin', 'Ireland', None, 5.94)]

groupby column always work with the aggragate function it ans the question
BASED ON WHAT ARE YOU AGGRARATING?

In [49]:
%%sql
SELECT * FROM Invoice LIMIT 10;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86),
 (6, 37, '2009-01-19 00:00:00', 'Berger Straße 10', 'Frankfurt', None, 'Germany', '60316', 0.99),
 (7, 38, '2009-02-01 00:00:00', 'Barbarossastraße 19', 'Berlin', None, 'Germany', '10779', 1.98),
 (8, 40, '2009-02-01 00:00:00', '8, Rue Hanovre', 'Paris', None, 'France', '75002', 1.98),
 (9, 42, '2009-02-02 00:00:00', '9, Place Louis Barthou', 'Bordeaux', None, 'France', '33000', 3.96),
 (10, 46, '2009-02-03 00:00:00', '3 Chatham Street', 'Dublin', 'Dublin', 'Ireland', None, 5.94)]

In [59]:
%%sql
SELECT BillingCountry,COUNT(CustomerId) AS TOTAL_CUSTOMER FROM Invoice GROUP BY BillingCountry;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[('Argentina', 7),
 ('Australia', 7),
 ('Austria', 7),
 ('Belgium', 7),
 ('Brazil', 35),
 ('Canada', 56),
 ('Chile', 7),
 ('Czech Republic', 14),
 ('Denmark', 7),
 ('Finland', 7),
 ('France', 35),
 ('Germany', 28),
 ('Hungary', 7),
 ('India', 13),
 ('Ireland', 7),
 ('Italy', 7),
 ('Netherlands', 7),
 ('Norway', 7),
 ('Poland', 7),
 ('Portugal', 14),
 ('Spain', 7),
 ('Sweden', 7),
 ('USA', 91),
 ('United Kingdom', 21)]

In [58]:
%%sql 
SELECT * FROM Invoice LIMIT 30;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86),
 (6, 37, '2009-01-19 00:00:00', 'Berger Straße 10', 'Frankfurt', None, 'Germany', '60316', 0.99),
 (7, 38, '2009-02-01 00:00:00', 'Barbarossastraße 19', 'Berlin', None, 'Germany', '10779', 1.98),
 (8, 40, '2009-02-01 00:00:00', '8, Rue Hanovre', 'Paris', None, 'France', '75002', 1.98),
 (9, 42, '2009-02-02 00:00:00', '9, Place Louis Barthou', 'Bordeaux', None, 'France', '33000', 3.96),
 (10, 46, '2009-02-03 00:00:00', '3 Chatham Street', 'Dublin', 'Dublin', 'Ireland', None, 5.94),
 (11, 52, '2009-02-06 00:00:00', '202 Hoxton Street', 'London', None, 'United Kingdom', 'N1 5LH', 8.91),
 (12, 2, '2009-02-11 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 13.86),
 (13, 16, '2009-02-19 00:00:00', '1600 Amphitheatre Parkway', 'Mountain View', 'CA', 'USA', '94043-1351', 0.99),
 (14, 17, '2009-03-04 00:00:00', '1 Microsoft Way', 'Redmond', 'WA', 'USA', '98052-8300', 1.98),
 (15, 19, '2009-03-04 00:00:00', '1 Infinite Loop', 'Cupertino', 'CA', 'USA', '95014', 1.98),
 (16, 21, '2009-03-05 00:00:00', '801 W 4th Street', 'Reno', 'NV', 'USA', '89503', 3.96),
 (17, 25, '2009-03-06 00:00:00', '319 N. Frances Street', 'Madison', 'WI', 'USA', '53703', 5.94),
 (18, 31, '2009-03-09 00:00:00', '194A Chain Lake Drive', 'Halifax', 'NS', 'Canada', 'B3S 1C5', 8.91),
 (19, 40, '2009-03-14 00:00:00', '8, Rue Hanovre', 'Paris', None, 'France', '75002', 13.86),
 (20, 54, '2009-03-22 00:00:00', '110 Raeburn Pl', 'Edinburgh ', None, 'United Kingdom', 'EH4 1HH', 0.99),
 (21, 55, '2009-04-04 00:00:00', '421 Bourke Street', 'Sidney', 'NSW', 'Australia', '2010', 1.98),
 (22, 57, '2009-04-04 00:00:00', 'Calle Lira, 198', 'Santiago', None, 'Chile', None, 1.98),
 (23, 59, '2009-04-05 00:00:00', '3,Raj Bhavan Road', 'Bangalore', None, 'India', '560001', 3.96),
 (24, 4, '2009-04-06 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 5.94),
 (25, 10, '2009-04-09 00:00:00', 'Rua Dr. Falcão Filho, 155', 'São Paulo', 'SP', 'Brazil', '01007-010', 8.91),
 (26, 19, '2009-04-14 00:00:00', '1 Infinite Loop', 'Cupertino', 'CA', 'USA', '95014', 13.86),
 (27, 33, '2009-04-22 00:00:00', '5112 48 Street', 'Yellowknife', 'NT', 'Canada', 'X1A 1N6', 0.99),
 (28, 34, '2009-05-05 00:00:00', 'Rua da Assunção 53', 'Lisbon', None, 'Portugal', None, 1.98),
 (29, 36, '2009-05-05 00:00:00', 'Tauentzienstraße 8', 'Berlin', None, 'Germany', '10789', 1.98),
 (30, 38, '2009-05-06 00:00:00', 'Barbarossastraße 19', 'Berlin', None, 'Germany', '10779', 3.96)]

In [63]:
%%sql
SELECT COUNT(CustomerID) AS NUMBER_OF_CUSTOMER, BillingCountry  FROM Invoice GROUP BY BillingCountry HAVING COUNT(CustomerID) > 30;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(35, 'Brazil'), (56, 'Canada'), (35, 'France'), (91, 'USA')]

In [66]:
%%sql
SELECT COUNT(*) NUMBER_OF_COUNTRY FROM Invoice WHERE BillingCountry="Brazil"

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(35,)]

In [67]:
%%sql
SELECT COUNT(*) NUMBER_OF_COUNTRY FROM Invoice WHERE BillingCountry="Canada"

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(56,)]

In [68]:
%%sql
SELECT COUNT(*) NUMBER_OF_COUNTRY FROM Invoice WHERE BillingCountry="USA"

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(91,)]

In [69]:
%%sql
SELECT COUNT(*) NUMBER_OF_COUNTRY FROM Invoice WHERE BillingCountry="Germany"

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(28,)]

In [71]:
%%sql
SELECT COUNT(CustomerID) AS NUMBER_OF_CUSTOMER, BillingCountry  FROM Invoice GROUP BY BillingCountry HAVING COUNT(CustomerID) > 30 ORDER BY NUMBER_OF_CUSTOMER DESC;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(91, 'USA'), (56, 'Canada'), (35, 'France'), (35, 'Brazil')]

-- SELECT 
-- distinct Extended_step 
SELECT distinct Extended_step
FROM salary_range_by_job_classification;

-- Select 
-- min(Biweekly_high_Rate)
-- From salary_range_by_job_classification
-- WHERE Biweekly_high_Rate <> '$0.00'    
SELECT DISTINCT Biweekly_high_Rate FROM salary_range_by_job_classification
ORDER BY Biweekly_high_Rate ASC;

Select
job_code,
pay_type
FROM
salary_range_by_job_classification WHERE job_code LIKE '03%' 

SELECT Step FROM salary_range_by_job_classification WHERE job_code = '0110' OR job_code = '0400';
SELECT (Biweekly_High_Rate-Biweekly_Low_Rate) FROM salary_range_by_job_classification WHERE Job_Code='0170';
SELECT Extended_Step FROM salary_range_by_job_classification WHERE Pay_Type IN ('M','H','D');
SELECT * FROM salary_range_by_job_classification WHERE Union_Code='990' AND (Salary_SetID = 'COMMN' OR Salary_SetID = 'SFMTA' );
SELECt * FROM Tracks WHERE Milliseconds > 5000000 ;
SELECT COUNT(*) FROM Invoices WHERE Total BETWEEN 5 AND 15;
SELECt * FROM Customers WHERE State IN ('RJ', 'DF', 'AB', 'BC', 'CA', 'WA', 'NY');
SELECT * FROM Invoices WHERE InvoiceId = 315;
SELECT * FROM Customers WHERE Email LIKE 'J%@gmail.com';
SELECT * FROM Invoices WHERE BillingCity IN ('Brasília', 'Edmonton','Vancouver') ORDER BY InvoiceId ;
SELECT CustomerId,COUNT(*) FROM Invoices GROUP BY CustomerId;
SELECT Albums.ALbumId,Albums.title,Tracks.TrackId FROM Albums
join Tracks ON Albums.ALbumId = Tracks.AlbumId
GROUP BY Albums.AlbumId
HAVING COUNT(Tracks.TrackId)>=12

In [75]:
%%sql
SELECT * FROM Album LIMIT 10;

 * sqlite:///Chinook_Sqlite.sqlite
Done.

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3),
 (6, 'Jagged Little Pill', 4),
 (7, 'Facelift', 5),
 (8, 'Warner 25 Anos', 6),
 (9, 'Plays Metallica By Four Cellos', 7),
 (10, 'Audioslave', 8)]